# Filtering and subsetting using conditionals without loc or iloc

In [1]:
import pandas as pd

In [2]:
students_score = {
    'Name' : ['Paul', 'Aaron', 'Krista', 'Veronica', 'Paxton', 'Madison', 'Aurora'],
    'Score': [98, 89, 99, 87, 90, 83, 82],
    'Grades': ['AA', 'AB', 'AA', 'AC', 'AB', 'BA', 'BB']
}

df_students = pd.DataFrame(students_score, index=['s1', 's2', 's3', 's4', 's5', 's6', 's7'])

df_students

        Name  Score Grades
s1      Paul     98     AA
s2     Aaron     89     AB
s3    Krista     99     AA
s4  Veronica     87     AC
s5    Paxton     90     AB
s6   Madison     83     BA
s7    Aurora     82     BB

## 1. Without loc/iloc

### 1.1. Students with scores over 90

In [3]:
df_students[df_students['Score'] > 90]

      Name  Score Grades
s1    Paul     98     AA
s3  Krista     99     AA

### 1.2. Student(s) who has/have AB

In [4]:
df_students[df_students['Grades'] == 'AB']

      Name  Score Grades
s2   Aaron     89     AB
s5  Paxton     90     AB

### 1.3. Student(s) with scores over 90 and AB

In [9]:
df_students[(df_students['Score'] > 90) & (df_students['Grades'] == 'AB')]

Empty DataFrame
Columns: [Name, Score, Grades]
Index: []

Using `or` operator

In [12]:
df_students[(df_students['Grades'] == 'AB') | (df_students['Score'] > 90)]

      Name  Score Grades
s1    Paul     98     AA
s2   Aaron     89     AB
s3  Krista     99     AA
s5  Paxton     90     AB

### 1.4. Name of students with score over 90

In [15]:
df_students[df_students['Score'] > 90]['Name']

s1      Paul
s3    Krista
Name: Name, dtype: object

### 1.5. Name of students with AB

In [19]:
df_students[df_students['Grades'] == 'AB']['Name']

s2     Aaron
s5    Paxton
Name: Name, dtype: object

## 2. With loc

### 2.1. Students with score over 95 using `loc[]`

In [20]:
df_students.loc[df_students['Score'] > 95]

      Name  Score Grades
s1    Paul     98     AA
s3  Krista     99     AA

### 2.2. Students with score over 95 and AB using `loc[]`

In [22]:
df_students.loc[(df_students['Score'] > 95) & (df_students['Grades'] == 'AB')]

Empty DataFrame
Columns: [Name, Score, Grades]
Index: []

## 3. with iloc

### 3.1. Students with score over 90 using `iloc[]`

In [28]:
df_students.iloc[:, 1] > 90

s1     True
s2    False
s3     True
s4    False
s5    False
s6    False
s7    False
Name: Score, dtype: bool

In [29]:
df_students[df_students.iloc[:, 1] > 90]

      Name  Score Grades
s1    Paul     98     AA
s3  Krista     99     AA

### 3.2. Students with score over 90 and AB using `iloc[]`

In [36]:
df_students.iloc[:, 1] > 80

s1    True
s2    True
s3    True
s4    True
s5    True
s6    True
s7    True
Name: Score, dtype: bool

In [37]:
df_students.iloc[:, 2] == 'AB'

s1    False
s2     True
s3    False
s4    False
s5     True
s6    False
s7    False
Name: Grades, dtype: bool

Combined, we get:

In [38]:
df_students[(df_students.iloc[:, 1] > 80) & (df_students.iloc[:, 2] == 'AB')]

      Name  Score Grades
s2   Aaron     89     AB
s5  Paxton     90     AB

### 3.3. Name of students with AB

In [41]:
df_students[df_students.iloc[:, 2] == 'AB']['Name']

s2     Aaron
s5    Paxton
Name: Name, dtype: object